{
  "session_id": "session_20250616_203321_2fa90db8",
  "job_posting": {
    "job_id": "job_20250616_203321",
    "title": "Software Engineer, Large Scale Pre-Training Performance",
    "company": "",
    "department": null,
    "location": null,
    "employment_type": null,
    "experience_level": null,
    "required_skills": [],
    "preferred_skills": [],
    "description": "About the job\nSnapshot\n\nWe are seeking a software engineer to define, drive, and critically contribute to the next generation of the state-of-the-art ML models on TPU. As part of the Pre-Training team you will co-design the model, and implement critical components across Model architecture, ML frameworks, custom kernels and platform, to deliver frontier models with maximum efficiency.\n\nAbout Us\n\nArtificial Intelligence could be one of humanity’s most useful inventions. At Google DeepMind, we’re a team of scientists, engineers, machine learning experts and more, working together to advance the state of the art in artificial intelligence. We use our technologies for widespread public benefit and scientific discovery, and collaborate with others on critical challenges, ensuring safety and ethics are the highest priority.\n\nThe Role\n\nWe’re looking for a Software Engineer to re-define efficient training of frontier LLMs at massive scale. This role offers an opportunity to influence the design of frontier LLM models, and drive an effort to ensure efficient training and inference.\n\nKey responsibilities:\n\nBeing responsible for Pre-Training efficiency and optimising the performance of the latest models on Google’s fleet of hardware accelerators - throughout the entire LLM research, training and deployment lifecycle. \nBeing responsible for guiding model design to ensure inference-efficiency. \nGreatly improving the performance of LLM models on hardware accelerators by optimizing at all levels, including developing custom kernels when necessary. \nCollaborating with the compiler, framework, and platform teams. And ensure efficient training at industry-largest scale. \nProfile models to identify performance bottlenecks and opportunities for optimization. \nDevelop low-level custom kernels for maximum performance of the most critical operators. \nCollaborating with research teams by enabling new critical operators in advance of their availability in frameworks and compilers. \n\nAbout You\n\nYou're an engineer looking to re-define efficient training of frontier LLMs at massive scale and have:\n\nA proven track record of critical contributions to the distributed training of LLMs at 1e25 FLOPs scale on modern GPU/TPU clusters \nExperience in programming hardware accelerators GPU/TPUs via ML frameworks (e.g. JAX, PyTorch) and low-level programming models (e.g. CUDA, OpenCL) \nExperience in leveraging custom kernels and compiler infrastructure to improve performance on hardware \nExperience with Python and neural network training (publications, open-source projects, relevant work experience, etc.) \n\nThe US base salary range for this full-time position is between $235,000 - $350,000 + bonus + equity + benefits. Your recruiter can share more about the specific salary range for your targeted location during the hiring process.\n\nApplication deadline: March 12, 2025\n\nNote: In the event your application is successful and an offer of employment is made to you, any offer of employment will be conditional on the results of a background check, performed by a third party acting on our behalf. For more information on how we handle your data, please see our Applicant and Candidate Privacy Policyopen_in_new.\n\nAt Google DeepMind, we value diversity of experience, knowledge, backgrounds and perspectives and harness these qualities to create extraordinary impact. We are committed to equal employment opportunity regardless of sex, race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation, gender identity, pregnancy, or related condition (including breastfeeding) or any other basis as protected by applicable law. If you have a disability or additional need that requires accommodation, please do not hesitate to let us know.",
    "requirements": null,
    "responsibilities": null,
    "education_requirements": null,
    "salary_range": null,
    "benefits": null,
    "created_at": "2025-06-16T20:33:21.734295"
  },
  "uploaded_files": [
    "data\\cvs\\pending\\c1ffaa973cfb4014a1e7137f71bf7d57_Suraiyaa Zabeen.txt",
    "data\\cvs\\pending\\01d4c3da057f4c3cb6509be6b35b3e33_Jack Townsend.txt",
    "data\\cvs\\pending\\372efa9f62e44976a8ca847a7b883eb9_Neethu Muraleedharan.txt",
    "data\\cvs\\pending\\729e81d072e849a39ce137d1a4e4b105_Taiyu Xie.txt",
    "data\\cvs\\pending\\563b89be00c74ac0874cc9907e3fcf7d_Gül Çetin.txt",
    "data\\cvs\\pending\\93e07ab45e8347b2a46d3f3f5214769c_Sahil Hussain.txt",
    "data\\cvs\\pending\\c496109daf92456f96f57a8286740067_Sharaf M.txt",
    "data\\cvs\\pending\\018cea4e5b6f49c494fb9fd9401237dc_Siddhesh Sathe.txt",
    "data\\cvs\\pending\\4ec2b3c8a2544371b091f215cd1ac42d_Saad LAOUADI.txt"
  ],
  "candidates": [
    {
      "candidate_id": "c1ffaa973cfb4014a1e7_20250616_203414_f4518147",
      "file_name": "c1ffaa973cfb4014a1e7137f71bf7d57_Suraiyaa Zabeen.txt",
      "full_name": "Dr. Suraiyaa Zabeen",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "London, England, United Kingdom",
        "linkedin": "www.linkedin.com/in/suraiyazabeen",
        "github": null
      },
      "summary": "I have 12 years of experience working in research and development of aerospace materials. In 2014, I founded Trustworthy foundation, a mental health charity for furthering children's mental health education, to raise awareness about learning disability and to support staff at all educational levels.",
      "skills": [
        "Communication",
        "Software Development",
        "Materials Science",
        "Data Science",
        "Machine Learning",
        "Research and Development",
        "Aerospace Materials",
        "Stress Management",
        "Emotional Intelligence",
        "Leadership Development",
        "Synchrotron X-ray",
        "Neutron Diffraction",
        "Light Microscopy",
        "FEGSEM",
        "Vickers Hardness Testing",
        "Instrumented Indentation",
        "Tensile Testing",
        "Chemical Analysis",
        "Laboratory Equipment Operation"
      ],
      "experience": [
        {
          "title": "Data Scientist",
          "company": "Agilance Property",
          "start_date": "09/2023",
          "end_date": "Present",
          "duration_months": 22,
          "description": null,
          "achievements": []
        },
        {
          "title": "Founder",
          "company": "Trustworthy Foundation UK",
          "start_date": "2014",
          "end_date": "04/2024",
          "duration_months": 120,
          "description": "We provide unique, training on stress management, anxiety, resilience, and emotional intelligence that will help your people perform better",
          "achievements": [
            "Specialization in Emotional Intelligence",
            "Performance under Stress",
            "Employee Wellbeing",
            "Leadership Development",
            "Conflict resolution",
            "Stress and Anxiety Management",
            "Recovery Support Program for high achievers"
          ]
        },
        {
          "title": "Software Engineer",
          "company": "Bank of America",
          "start_date": "10/2022",
          "end_date": "09/2023",
          "duration_months": 12,
          "description": null,
          "achievements": []
        },
        {
          "title": "Data Science and Machine Learning Educator",
          "company": "Flourishing-Life Ai",
          "start_date": "11/2018",
          "end_date": "01/2023",
          "duration_months": 51,
          "description": null,
          "achievements": []
        },
        {
          "title": "Senior Research Scientist",
          "company": "Coventry University",
          "start_date": "09/2016",
          "end_date": "01/2018",
          "duration_months": 17,
          "description": "Leading, planning and executing a range of research projects in respect of the structural integrity of aerospace components",
          "achievements": [
            "Supervised research students",
            "Published research findings in journal articles",
            "Developed and managed relationships with external partners",
            "Delivered training and supervision to students",
            "Supported University's contract proposal to ESA as key facilitator"
          ]
        },
        {
          "title": "Senior Research Scientist",
          "company": "Coventry University",
          "start_date": "05/2014",
          "end_date": "09/2016",
          "duration_months": 29,
          "description": "Primarily accountable for collating, reviewing and publishing research findings in journal articles",
          "achievements": [
            "Developed new and existing research proposals, grants and funding applications",
            "Managed and coordinated laboratory functions",
            "Contributed to teaching and learning programs",
            "Supervised MSc and BSc research projects"
          ]
        },
        {
          "title": "Post Doctoral Research Associate",
          "company": "The Open University",
          "start_date": "01/2013",
          "end_date": "05/2014",
          "duration_months": 17,
          "description": "Project: The effect of laser shock peening on the hardening and residual stress response in Al 2624 alloy",
          "achievements": [
            "Conducted literature review on around 200 technical papers",
            "Conducted scientific experiments using high-energy Synchrotron X-ray and Neutron Diffraction",
            "Published results in top quartile (Q1) scientific journals"
          ]
        },
        {
          "title": "Lloyd's Register Educational Trust Research Collegium",
          "company": "University of Southampton",
          "start_date": "07/2012",
          "end_date": "09/2012",
          "duration_months": 3,
          "description": "Attended Llyds' register educational trust research collegium",
          "achievements": []
        },
        {
          "title": "Research Consultant",
          "company": "The University of Manchester",
          "start_date": "01/2011",
          "end_date": "03/2012",
          "duration_months": 15,
          "description": "Characterization of residual stresses in laser shock peened Ti-6Al-4V discs by Contour method",
          "achievements": [
            "Investigation of residual stresses in laser shock peened double edge notched Al 7050 alloy"
          ]
        },
        {
          "title": "Chemical Analyst and Design Engineer",
          "company": "Holcim Bangladesh Ltd.",
          "start_date": "06/2005",
          "end_date": "06/2006",
          "duration_months": 13,
          "description": "Performed chemical analysis (routine and non-routine) analysis of products using standard operating procedures",
          "achievements": [
            "Operated a range of laboratory equipment safely",
            "Handled customer complaints",
            "Maintained products certification by getting them tested by external certification bodies"
          ]
        }
      ],
      "education": [
        {
          "degree": "Data Science/Machine Learning",
          "institution": "AiCore",
          "graduation_year": 2021,
          "gpa": null,
          "field_of_study": "Data Science/Machine Learning"
        },
        {
          "degree": "PhD",
          "institution": "The University of Manchester",
          "graduation_year": 2011,
          "gpa": null,
          "field_of_study": "Aerospace Materials"
        },
        {
          "degree": "MSc",
          "institution": "The University of Manchester",
          "graduation_year": 2007,
          "gpa": null,
          "field_of_study": "Advanced Engineering Materials"
        },
        {
          "degree": "BSc Engg.",
          "institution": "Bangladesh University of Engineering and Technology",
          "graduation_year": 2004,
          "gpa": null,
          "field_of_study": "Materials and Metallurgical Engg."
        }
      ],
      "certifications": [
        "Neural Networks and Deep Learning",
        "The Neuroscience of Learning",
        "Databases and SQL for Data Science",
        "Problem Solving Techniques",
        "Advanced Machine Learning and Signal Processing"
      ],
      "languages": [
        "English (Full Professional)",
        "Arabic (Limited Working)",
        "Hindi (Professional Working)"
      ],
      "projects": [
        "Effect of selective laser melting scanning strategy on the residual stress and texture of Ti-6Al-4V material",
        "Residual Stress Characterization in Friction Stir Welded Launchers Structures after Laser Shock Peening",
        "Effect of crystallographic texture on the residual stress generation by laser shock peening in Aluminium-Lithium alloy",
        "The effect of laser shock peening on the hardening and residual stress response in Al 2624 alloy",
        "Characterization of residual stresses in laser shock peened Ti-6Al-4V discs by Contour method",
        "Investigation of residual stresses in laser shock peened double edge notched Al 7050 alloy"
      ],
      "raw_text": "Contact\nwww.linkedin.com/in/\nsuraiyazabeen (LinkedIn)\nTop Skills\nCommunication\nSoftware Development\nMaterials Science\nLanguages\nEnglish (Full Professional)\nArabic (Limited Working)\nHindi (Professional Working)\nCertifications\nNeural Networks and Deep Learning\nThe Neuroscience of Learning\nDatabases and SQL for Data\nScience\nProblem Solving Techniques\nAdvanced Machine Learning and\nSignal Processing\nHonors-Awards\nAssociate Fellow of the Higher\nEducation Academy\nLloyd's Register Educational Trust\nScholarship\nPublications\nPolymetallic nodule mining:\nInnovative concepts for\ncommercialisation\nResidual stresses caused by headon\nand 45° foreign object damage\nfor a laser shock peened Ti–6Al–4V\nalloy aerofoil\nEffect of texture on the residual\nstress response from laser peening\nof an aluminium-lithium alloy\nMachine Learning-Based Prediction\nand Optimisation System for Laser\nShock Peening\nDr. Suraiyaa Zabeen\nData Scientist | Materials Science\nLondon, England, United Kingdom\nSummary\nI have 12 years of experience working in research and development\nof aerospace materials. In 2014, I founded Trustworthy foundation,\na mental health charity for furthering children's mental health\neducation, to raise awareness about learning disability and to\nsupport staff at all educational levels.\nExperience\nAgilance Property\nData Scientist\nSeptember 2023 - Present (1 year 10 months)\nTrustworthy Foundation UK\nFounder\n2014 - April 2024 (10 years)\nDhaka, Bangladesh\nWe provide unique, training on stress management, anxiety, resilience, and\nemotional intelligence that will help your people perform better\nOur Specialization:\n• Emotional Intelligence\n• Performance under Stress\n• Employee Wellbeing\n• Leadership Development\n• Conflict resolution\n• Stress and Anxiety Management\n• Recovery Support Program for high achievers\nBank of America\nSoftware Engineer\nOctober 2022 - September 2023 (1 year)\nLondon, England, United Kingdom\nFlourishing-Life Ai\nData Science and Machine Learning Educator\nPage 1 of 5\nEFFECT OF PRESSURE ONTHE RESIDUAL STRESSDEVELOPMENT IN THE LINEARFRICTION WELDED Ti6246\nNovember 2018 - January 2023 (4 years 3 months)\nLondon, England, United Kingdom\nCoventry University\n3 years 9 months\nSenior Research Scientist\nSeptember 2016 - January 2018 (1 year 5 months)\nCoventry, United Kingdom\nKey Accountabilities1. Tasked with leading, planning and executing a range of research projects inrespect of the structural integrity of aerospace components including preparingproposals and completing individual and collaborative research projects2. Supervised research students.3. Instrumental in collating, conceptualising and publishing research findingsin journal articles and successfully contributed to the development andenhancement of new and existing research proposals and ideas4. Trained and coached staff, Technician, PhD, MSc and undergraduatestudents.5. Developed and managed relationships with external partners, academicsand industrial partners6. Provided technical assistance to colleagues and laboratory staff regardingproduct use7. Delivered training and supervision to students during their research topics8. Updated records, prepared technical papers and made technicalpresentations to develop publications9. Played a pivotal role in supporting the University’s contract proposal to theESA (European Space Agency) as key facilitatorKey Projects at Coventry University1. Effect of selective laser melting scanning strategy on the residual stressand texture of Ti-6Al-4V material (Funded by Coventry University FacultyResearch Centre in collaboration with Birmingham University)2. Residual Stress Characterization in Friction Stir Welded LaunchersStructures after Laser Shock Peening to enhance Stress-Corrosion Crackingand Fatigue Resistance (Funded by European Space Agency)\nSenior Research Scientist\nMay 2014 - September 2016 (2 years 5 months)\nCoventry, United Kingdom\nPage 2 of 5\nKey Accountabilities1. Primarily accountable for collating, reviewing and publishing researchfindings in journal articles for the project2. Played a key role in defining and developing new and existing researchproposals, grants and funding applications to external bodes for project/research funding and contractual requirements3. Built, managed and maintained effective relationships with industrialpartners and academics to support projects4. Managed and coordinated laboratory functions including purchasing,inventory management, health and safety, and training and development ofstudents, staff and external delegates5. Identified, planned and managed small scale research activities and devisednew research methodologies6. Instrumental in contributing to teaching and learning programs includingassessing students, supervising MSc and BSc research projects, developingstudent research skills and providing one-to-one tuition Key Projects1. Effect of crystallographic texture on the residual stress generation bylaser shock peening in Aluminium-Lithium alloy (Funded by Air Force Officeof Scientific Research, Air Force Material Command, USAF, under grant noFA8655-12-1-2084)\nThe Open University\nPost Doctoral Research Associate\nJanuary 2013 - May 2014 (1 year 5 months)\nMilton Keynes, United Kingdom\nProject: “The effect of laser shock peening on the hardening and residualstress response in Al 2624 alloy”1. Conducted literature review on the subject that involved around 200technical papers2. Conducted scientific experiments using high-energy Synchrotron X-ray andNeutron Diffraction. 3. Carried out data analysis using a combination of scientific software. 4. Presented research outcomes in the national and international conferences5. Conducted investigation using light microscopy, FEGSEM, Vickers hardnesstesting, instrumented indentation, tensile testing.6. Published results in the top quartile (Q1) scientific journals.\nPage 3 of 5\nUniversity of Southampton\nLloyd's Register Educational Trust Research Collegium\nJuly 2012 - September 2012 (3 months)\nSouthampton, United Kingdom\nAttended Llyds' register educational trust research collegium\nThe University of Manchester\nResearch Consultant\nJanuary 2011 - March 2012 (1 year 3 months)\nManchester\n1. Project: “Characterization of residual stresses in laser shock peenedTi-6Al-4V discs by Contour method’’ 2. Project: ‘’Investigation of residual stresses in laser shock peened doubleedge notched Al 7050 alloy’’\nHolcim Bangladesh Ltd.\nChemical Analyst and Design Engineer\nJune 2005 - June 2006 (1 year 1 month)\n• Performed chemical analysis (routine and non-routine) analysis of productsusing standard operating procedures• Conceptualised, produced and executed chemical testing procedures andensured documentation was updated• Operated a range of laboratory equipment safely, evaluated and reportedtest results to managers, and recorded all test data in respect of chemicaladditions, purifications and dump cycles• Tasked with maintaining, monitoring and updating the inventory of chemicalsand supplies• Liaised with production department to ensure quality • Handled customer complaints• Maintained products certification by getting them tested by externalcertification bodies such as BSTI and BUET\nEducation\nAiCore\nData Science/Machine Learning · (2020 - 2021)\nThe University of Manchester\nPhD, Aerospace Materials · (2007 - 2011)\nPage 4 of 5\nThe University of Manchester\nMSc, Advanced Engineering Materials · (2006 - 2007)\nBangladesh University of Engineering and Technology\nBSc Engg., Materials and Metallurgical Engg. · (1999 - 2004)\nPage 5 of 5",
      "parsed_at": "2025-06-16T20:34:14.703804",
      "file_path": "data\\cvs\\processed\\c1ffaa973cfb4014a1e7_20250616_203414_f4518147_c1ffaa973cfb4014a1e7137f71bf7d57_Suraiyaa Zabeen.txt"
    },
    {
      "candidate_id": "01d4c3da057f4c3cb650_20250616_203329_d51cbff7",
      "file_name": "01d4c3da057f4c3cb6509be6b35b3e33_Jack Townsend.txt",
      "full_name": "Jack Townsend",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "London, England, United Kingdom",
        "linkedin": "www.linkedin.com/in/jack-townsend-3b14a5163",
        "github": null
      },
      "summary": null,
      "skills": [
        "Artificial Intelligence (AI)",
        "PyTorch",
        "Cluster Analysis"
      ],
      "experience": [
        {
          "title": "Data Scientist",
          "company": "GEOLYTIX",
          "start_date": "04/2021",
          "end_date": "Present",
          "duration_months": 51,
          "description": null,
          "achievements": []
        },
        {
          "title": "Location Analyst",
          "company": "CACI Ltd",
          "start_date": "09/2017",
          "end_date": "04/2021",
          "duration_months": 44,
          "description": null,
          "achievements": []
        }
      ],
      "education": [
        {
          "degree": "Bachelor's degree",
          "institution": "University of Birmingham",
          "graduation_year": 2017,
          "gpa": null,
          "field_of_study": "Mathematics"
        }
      ],
      "certifications": [],
      "languages": [],
      "projects": [],
      "raw_text": "Contact\nwww.linkedin.com/in/jack-townsend-3b14a5163 (LinkedIn)\nTop Skills\nArtificial Intelligence (AI)\nPyTorch\nCluster Analysis\nJack Townsend\nData Scientist at GEOLYTIX\nLondon, England, United Kingdom\nExperience\nGEOLYTIX\nData Scientist\nApril 2021 - Present (4 years 3 months)\nLondon, England, United Kingdom\nCACI Ltd\nLocation Analyst\nSeptember 2017 - April 2021 (3 years 8 months)\nEducation\nUniversity of Birmingham\nBachelor's degree, Mathematics · (2014 - 2017)\nPage 1 of 1",
      "parsed_at": "2025-06-16T20:33:29.177945",
      "file_path": "data\\cvs\\processed\\01d4c3da057f4c3cb650_20250616_203329_d51cbff7_01d4c3da057f4c3cb6509be6b35b3e33_Jack Townsend.txt"
    },
    {
      "candidate_id": "372efa9f62e44976a8ca_20250616_203412_931ee65e",
      "file_name": "372efa9f62e44976a8ca847a7b883eb9_Neethu Muraleedharan.txt",
      "full_name": "Neethu Muraleedharan",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "London, England, United Kingdom",
        "linkedin": "www.linkedin.com/in/neethu-muraleedharan",
        "github": null
      },
      "summary": "Neethu is a passionate Data Scientist dedicated to unravelling the narratives hidden within data. With a Master's degree in Data Science from Lancaster University and proficiency in Python, SQL, and machine learning, she excels at merging data insights with strategic business goals. Throughout her career, Neethu has orchestrated complex data strategies, led stakeholder engagements, and developed automated dashboards to drive informed decisions. Her expertise spans regression, classification, clustering, and more, enabling her to uncover actionable patterns and trends that propel organisational success. Beyond her professional pursuits, she finds inspiration in music and art—singing and drawing serve as her creative outlets. In all her endeavours, whether crafting predictive models or creating art, she brings creativity, curiosity, and a commitment to excellence.",
      "skills": [
        "Artificial Intelligence (AI)",
        "Text Mining",
        "Crystal Reports",
        "Python",
        "SQL",
        "Machine Learning",
        "Regression",
        "Classification",
        "Clustering",
        "Data Analysis",
        "Predictive Modelling",
        "Data Visualization",
        "Power BI",
        "Google Analytics",
        "Meta Business Suite",
        "SEO",
        "Dashboard Development",
        "Stakeholder Engagement"
      ],
      "experience": [
        {
          "title": "Data Scientist",
          "company": "Career Connect",
          "start_date": "07/2023",
          "end_date": "12/2024",
          "duration_months": 18,
          "description": "At Career Connect, I focus on analyzing data to develop predictive models that assess the risk of young individuals becoming NEET (Not in Education, Employment, or Training). By examining historical trends and key factors such as demographics, education, and socio-economic conditions, I identify patterns that inform early intervention strategies to reduce NEET rates and promote youth engagement. My role involves collaborating with teams to collect and refine data, ensuring that analyses are accurate and actionable. The insights I generate support evidence-based policy-making and program design. Additionally, I streamline reporting processes, build dashboards, and provide strategic insights to advance Career Connect's mission. Through data-driven analytics, I aim to enhance educational, employment, and training outcomes, helping young people achieve long-term success.",
          "achievements": [
            "Developed predictive models to assess NEET risk",
            "Streamlined reporting processes",
            "Built dashboards for strategic insights",
            "Supported evidence-based policy-making"
          ]
        },
        {
          "title": "Data Science Intern",
          "company": "Lancashire County Council",
          "start_date": "06/2022",
          "end_date": "09/2022",
          "duration_months": 4,
          "description": "I've played a pivotal role in revolutionising healthcare services through data-driven insights and innovative solutions. From aggregating and structuring complex datasets to developing predictive models for attendance forecasting, my journey as a Data Science Intern at LCC has been marked by a relentless pursuit of efficiency and excellence. Leveraging advanced analytics tools like Python and Power BI, I've unearthed actionable insights that have not only optimised NHS health check services but also empowered decision-makers with invaluable information. My collaborative spirit and effective communication have fostered a dynamic team environment, where sharing insights and ideas is paramount to success. My passion for making a tangible impact in healthcare, combined with a diverse skill set encompassing data analysis, predictive modelling, and visualisation, continues to drive me towards shaping a brighter future for healthcare delivery.",
          "achievements": [
            "Developed predictive models for attendance forecasting",
            "Optimised NHS health check services",
            "Aggregated and structured complex healthcare datasets"
          ]
        },
        {
          "title": "Business Analyst",
          "company": "Evoke Frames By Sarath Santhan",
          "start_date": "01/2019",
          "end_date": "10/2021",
          "duration_months": 34,
          "description": "My role at Evoke Frames encompasses a diverse array of responsibilities crucial to the company's growth and client acquisition. Key highlights include building strong client relationships, developing sales and marketing strategies, identifying and mitigating business risks, and utilising data insights for informed decision-making. By leveraging tools like Google Analytics and Meta Business Suite, I've spearheaded web analysis and implemented SEO-focused content strategies, resulting in significant reductions in bounce rates and notable sales increases. My multifaceted contributions at the intersection of client relations, data analysis, and strategic decision-making have been instrumental in elevating Evoke Frame's market presence and driving substantial growth.",
          "achievements": [
            "Significant reductions in bounce rates",
            "Notable sales increases",
            "Implemented SEO-focused content strategies",
            "Elevated company's market presence"
          ]
        },
        {
          "title": "IT Engineer",
          "company": "Wipro Technologies",
          "start_date": "01/2015",
          "end_date": "10/2015",
          "duration_months": 10,
          "description": null,
          "achievements": []
        },
        {
          "title": "Trainee",
          "company": "Wipro Technologies",
          "start_date": "10/2014",
          "end_date": "12/2014",
          "duration_months": 3,
          "description": null,
          "achievements": []
        }
      ],
      "education": [
        {
          "degree": "Master's degree",
          "institution": "Lancaster University",
          "graduation_year": 2022,
          "gpa": null,
          "field_of_study": "Data Science"
        },
        {
          "degree": "Master of Science - MSc",
          "institution": "Pillai College of Arts,Commerce and Science",
          "graduation_year": 2018,
          "gpa": null,
          "field_of_study": "Information Technology"
        },
        {
          "degree": "Bachelor of Science - BSc",
          "institution": "Pillai College of Arts,Commerce and Science",
          "graduation_year": 2014,
          "gpa": null,
          "field_of_study": "Information Technology"
        }
      ],
      "certifications": [
        "IBM Data Science Professional Certificate",
        "Data Visualization with Python",
        "Tools for Data Science",
        "Data Analysis with Python"
      ],
      "languages": [],
      "projects": [],
      "raw_text": "Contact\nwww.linkedin.com/in/neethu-muraleedharan (LinkedIn)\nTop Skills\nArtificial Intelligence (AI)\nText Mining\nCrystal Reports\nCertifications\nIBM Data Science ProfessionalCertificate\nData Visualization with Python\nTools for Data Science\nData Analysis with Python\nIBM Data Science ProfessionalCertificate\nNeethu Muraleedharan\nData Scientist | Predictive Modelling and AI Solutions\nLondon, England, United Kingdom\nSummary\nNeethu is a passionate Data Scientist dedicated to unravellingthe narratives hidden within data. With a Master's degree in DataScience from Lancaster University and proficiency in Python, SQL,and machine learning, she excels at merging data insights withstrategic business goals.Throughout her career, Neethu has orchestrated complex datastrategies, led stakeholder engagements, and developed automateddashboards to drive informed decisions. Her expertise spansregression, classification, clustering, and more, enabling her touncover actionable patterns and trends that propel organisationalsuccess.Beyond her professional pursuits, she finds inspiration in music andart—singing and drawing serve as her creative outlets.In all her endeavours, whether crafting predictive models or creatingart, she brings creativity, curiosity, and a commitment to excellence.\nExperience\nCareer Connect\nData Scientist\nJuly 2023 - December 2024 (1 year 6 months)\nLiverpool, England, United Kingdom\nAt Career Connect, I focus on analyzing data to develop predictive modelsthat assess the risk of young individuals becoming NEET (Not in Education,Employment, or Training). By examining historical trends and key factors suchas demographics, education, and socio-economic conditions, I identify patternsthat inform early intervention strategies to reduce NEET rates and promoteyouth engagement.\nPage 1 of 3\nMy role involves collaborating with teams to collect and refine data, ensuringthat analyses are accurate and actionable. The insights I generate supportevidence-based policy-making and program design. Additionally, I streamlinereporting processes, build dashboards, and provide strategic insights toadvance Career Connect's mission. Through data-driven analytics, I aim toenhance educational, employment, and training outcomes, helping youngpeople achieve long-term success.\nLancashire County Council\nData Science Intern\nJune 2022 - September 2022 (4 months)\nPreston, England, United Kingdom\nI've played a pivotal role in revolutionising healthcare services through data-driven insights and innovative solutions. From aggregating and structuringcomplex datasets to developing predictive models for attendance forecasting,my journey as a Data Science Intern at LCC has been marked by a relentlesspursuit of efficiency and excellence. Leveraging advanced analytics tools likePython and Power BI, I've unearthed actionable insights that have not onlyoptimised NHS health check services but also empowered decision-makerswith invaluable information. My collaborative spirit and effective communicationhave fostered a dynamic team environment, where sharing insights andideas is paramount to success. My passion for making a tangible impact inhealthcare, combined with a diverse skill set encompassing data analysis,predictive modelling, and visualisation, continues to drive me towards shapinga brighter future for healthcare delivery.\nEvoke Frames By Sarath Santhan\nBusiness Analyst\nJanuary 2019 - October 2021 (2 years 10 months)\nMumbai, Maharashtra, India\nMy role at Evoke Frames encompasses a diverse array of responsibilitiescrucial to the company's growth and client acquisition. Key highlights includebuilding strong client relationships, developing sales and marketing strategies,identifying and mitigating business risks, and utilising data insights for informeddecision-making. By leveraging tools like Google Analytics and Meta BusinessSuite, I've spearheaded web analysis and implemented SEO-focused contentstrategies, resulting in significant reductions in bounce rates and notablesales increases. My multifaceted contributions at the intersection of clientrelations, data analysis, and strategic decision-making have been instrumentalin elevating Evoke Frame's market presence and driving substantial growth.\nPage 2 of 3\nWipro Technologies\n1 year 1 month\nIT Engineer\nJanuary 2015 - October 2015 (10 months)\nMumbai, Maharashtra, India\nTrainee\nOctober 2014 - December 2014 (3 months)\nMumbai, Maharashtra, India\nEducation\nLancaster University\nMaster's degree, Data Science · (October 2021 - September 2022)\nPillai College of Arts,Commerce and Science\nMaster of Science - MSc, Information Technology · (July 2016 - June 2018)\nPillai College of Arts,Commerce and Science\nBachelor of Science - BSc, Information Technology · (April 2011 - March 2014)\nPage 3 of 3",
      "parsed_at": "2025-06-16T20:34:12.981839",
      "file_path": "data\\cvs\\processed\\372efa9f62e44976a8ca_20250616_203412_931ee65e_372efa9f62e44976a8ca847a7b883eb9_Neethu Muraleedharan.txt"
    },
    {
      "candidate_id": "729e81d072e849a39ce1_20250616_203335_98f818d9",
      "file_name": "729e81d072e849a39ce137d1a4e4b105_Taiyu Xie.txt",
      "full_name": "Taiyu Xie",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "London, England, United Kingdom",
        "linkedin": "www.linkedin.com/in/taiyu-xie-cqf-608648170",
        "github": null
      },
      "summary": null,
      "skills": [
        "Quantitative Finance",
        "Quantitative Research",
        "Derivatives",
        "Data Science"
      ],
      "experience": [
        {
          "title": "Data science Consultant",
          "company": "Accenture",
          "start_date": "11/2021",
          "end_date": "Present",
          "duration_months": 44,
          "description": null,
          "achievements": []
        },
        {
          "title": "COO & Co-Founder",
          "company": "Siotech LTD",
          "start_date": "10/2019",
          "end_date": "10/2021",
          "duration_months": 24,
          "description": null,
          "achievements": []
        },
        {
          "title": "Data Science Intern",
          "company": "China Mobile IoT Company Limited",
          "start_date": "07/2018",
          "end_date": "08/2018",
          "duration_months": 2,
          "description": null,
          "achievements": []
        },
        {
          "title": "Summer Intern",
          "company": "Zhongtai Financial International Limited",
          "start_date": "06/2017",
          "end_date": "09/2017",
          "duration_months": 4,
          "description": null,
          "achievements": []
        },
        {
          "title": "Technology consultant Intern",
          "company": "Bank of China",
          "start_date": "06/2016",
          "end_date": "08/2016",
          "duration_months": 3,
          "description": null,
          "achievements": []
        }
      ],
      "education": [
        {
          "degree": "Postgraduate",
          "institution": "King's College London",
          "graduation_year": 2019,
          "gpa": null,
          "field_of_study": "Data science"
        },
        {
          "degree": "Bachelor of Science - BS",
          "institution": "UCL",
          "graduation_year": 2018,
          "gpa": null,
          "field_of_study": "Mathematics"
        }
      ],
      "certifications": [
        "AWS Certified Cloud Practitioner",
        "Computational Methods in Pricing and Model Calibration",
        "Certificate in Quantitative Finance",
        "Optimization Methods in Asset Management"
      ],
      "languages": [
        "English (Professional Working)",
        "Chinese (Native or Bilingual)"
      ],
      "projects": [],
      "raw_text": "Contact\nwww.linkedin.com/in/taiyu-xie-cqf-608648170 (LinkedIn)\nTop Skills\nQuantitative Finance\nQuantitative Research\nDerivatives\nLanguages\nEnglish (Professional Working)\nChinese (Native or Bilingual)\nCertifications\nAWS Certified Cloud Practitioner\nComputational Methods in Pricingand Model Calibration\nCertificate in Quantitative Finance\nOptimization Methods in AssetManagement\nTaiyu Xie, CQF\nData Scientist\nLondon, England, United Kingdom\nExperience\nAccenture\nData science Consultant\nNovember 2021 - Present (3 years 8 months)\nLondon Area, United Kingdom\nSiotech LTD\nCOO & Co-Founder\nOctober 2019 - October 2021 (2 years 1 month)\nLondon, United Kingdom\nChina Mobile IoT Company Limited\nData Science Intern\nJuly 2018 - August 2018 (2 months)\nJinan, Shandong, China\nZhongtai Financial International Limited\nSummer Intern\nJune 2017 - September 2017 (4 months)\nQingdao, Shandong, China\nBank of China\nTechnology consultant Intern\nJune 2016 - August 2016 (3 months)\nQingdao, Shandong, China\nEducation\nKing's College London\nPostgraduate, Data science · (2018 - 2019)\nUCL\nBachelor of Science - BS, Mathematics · (2015 - 2018)\nPage 1 of 1",
      "parsed_at": "2025-06-16T20:33:35.467527",
      "file_path": "data\\cvs\\processed\\729e81d072e849a39ce1_20250616_203335_98f818d9_729e81d072e849a39ce137d1a4e4b105_Taiyu Xie.txt"
    },
    {
      "candidate_id": "563b89be00c74ac0874c_20250616_203358_5307df1e",
      "file_name": "563b89be00c74ac0874cc9907e3fcf7d_Gül Çetin.txt",
      "full_name": "Gül Çetin",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "Londra, İngiltere, Birleşik Krallık",
        "linkedin": "www.linkedin.com/in/gul-cetin",
        "github": null
      },
      "summary": "A lifelong learner interested in sustainability, technology and art",
      "skills": [
        "Data Science",
        "Programming",
        "Python (Programming Language)",
        "SQL",
        "Excel",
        "R",
        "Time series analysis",
        "Statistical analysis",
        "Regression modelling",
        "Logistic regression",
        "NLP models",
        "Transformer-based models",
        "Data pipelines",
        "Data preprocessing",
        "Data analysis",
        "ESG data"
      ],
      "experience": [
        {
          "title": "Data Scientist",
          "company": "apiday",
          "start_date": "09/2023",
          "end_date": "Present",
          "duration_months": 22,
          "description": "Working with ESG data pipelines and NLP models",
          "achievements": [
            "Engineered and maintained scalable ESG data pipelines using Python and SQL",
            "Reduced manual workload by over 200 hours annually",
            "Accelerated data delivery timelines by 35%",
            "Revamped ESG questionnaire-matching algorithms through transformer-based NLP models",
            "Improved matching accuracy by 30%"
          ]
        },
        {
          "title": "Scholarship Holder",
          "company": "Jean Monnet Burs Programı / Jean Monnet Scholarship Programme",
          "start_date": "09/2022",
          "end_date": "10/2023",
          "duration_months": 14,
          "description": "Selected for Turkey's longest and most prestigious scholarship program for research or postgraduate studies in EU member countries and the UK",
          "achievements": []
        },
        {
          "title": "Business Analyst",
          "company": "Rebos",
          "start_date": "08/2022",
          "end_date": "12/2022",
          "duration_months": 5,
          "description": "Optimised inventory levels and led data-driven revenue initiatives",
          "achievements": [
            "Optimised inventory levels using time series analysis, resulting in a 12% reduction in stockouts",
            "Led a data-driven revenue initiative that increased customer footfall by 5%",
            "Employed Python-based statistical analysis and regression modelling"
          ]
        },
        {
          "title": "Program Analyst",
          "company": "inzva",
          "start_date": "07/2020",
          "end_date": "07/2022",
          "duration_months": 25,
          "description": "Managed educational projects and programs focused on algorithms",
          "achievements": [
            "Managed 16 fully-funded projects, programmes, and educational events",
            "Engaged over 1,500 participants",
            "Achieved a 25% increase in student retention",
            "Achieved a 20% improvement in graduation rates over two academic years",
            "Increased participant satisfaction by 18%"
          ]
        },
        {
          "title": "Project Developer",
          "company": "Cameroon Association of Active Youths (CAMAAY)",
          "start_date": "08/2019",
          "end_date": "07/2020",
          "duration_months": 12,
          "description": "Developed sustainable development projects",
          "achievements": [
            "Developed the 'Better Street Lighting for Better Livelihoods' project proposal",
            "Raised €2,000 to install 20 solar street lamps in Cameroon",
            "Created employment opportunities for seven local youths"
          ]
        },
        {
          "title": "Research Assistant",
          "company": "TUBITAK",
          "start_date": "01/2020",
          "end_date": "03/2020",
          "duration_months": 3,
          "description": "Conducted data preprocessing and analysis for research paper",
          "achievements": [
            "Conducted data preprocessing and analysis for 'Regional Inequalities and the West-East Divide in Turkey'",
            "Used Excel and R on a large dataset spanning 1913–1991"
          ]
        },
        {
          "title": "Undergraduate Teaching Assistant",
          "company": "Boğaziçi University",
          "start_date": "09/2019",
          "end_date": "12/2019",
          "duration_months": 4,
          "description": "EC101 Principles of Microeconomics",
          "achievements": []
        }
      ],
      "education": [
        {
          "degree": "MSc",
          "institution": "The London School of Economics and Political Science (LSE)",
          "graduation_year": 2023,
          "gpa": null,
          "field_of_study": "Development Studies"
        },
        {
          "degree": "Bachelor's",
          "institution": "Bogazici University Department of Economics",
          "graduation_year": 2020,
          "gpa": null,
          "field_of_study": "Economics"
        },
        {
          "degree": "Exchange",
          "institution": "Ghent University",
          "graduation_year": 2019,
          "gpa": null,
          "field_of_study": "Economics"
        }
      ],
      "certifications": [
        "CS50: Introduction to Computer Science",
        "Scientific Computing with Python",
        "Excel Skills for Business: Intermediate I",
        "CS50's Web Programming with Python and JavaScript",
        "Excel Skills for Business: Intermediate II"
      ],
      "languages": [
        "Turkish (Native or Bilingual)",
        "English (Professional Working)",
        "French (Elementary)"
      ],
      "projects": [
        "Better Street Lighting for Better Livelihoods",
        "Regional Inequalities and the West-East Divide in Turkey"
      ],
      "raw_text": "İletişim Bilgileri\nwww.linkedin.com/in/gul-cetin(LinkedIn)\nEn Önemli Yetenekler\nData Science\nProgramming\nPython (Programming Language)\nLanguages\nFrench (Elementary)\nEnglish (Professional Working)\nTurkish (Native or Bilingual)\nCertifications\nCS50: Introduction to ComputerScience\nScientific Computing with Python\nExcel Skills for Business:Intermediate I\nCS50's Web Programming withPython and JavaScript\nExcel Skills for Business:Intermediate II\nGül Çetin\nData Scientist\nLondra, İngiltere, Birleşik Krallık\nÖzet\nA lifelong learner interested in sustainability, technology and art\nDeneyim\napiday\nData Scientist\nEylül 2023 - Present (1 yıl 10 ay)\nLondon Area, United Kingdom\n- Engineered and maintained scalable ESG data pipelines using Python andSQL, automating the collection, processing, and integration of structured andunstructured data. Reduced manual workload by over 200 hours annually andaccelerated data delivery timelines by 35%.- Revamped ESG questionnaire-matching algorithms through transformer-based NLP models, improving matching accuracy by 30% and enhancing ESGmetric classification at the portfolio level.\nJean Monnet Burs Programı / Jean Monnet Scholarship Programme\nScholarship Holder\nEylül 2022 - Ekim 2023 (1 yıl 2 ay)\nLondon, England, United Kingdom\nWithin the scope of the Scholarship Program, as one of Turkey’s longest andmost prestigious project, selected scholars are granted the right to do researchor postgraduate studies in a university in the EU member countries and theUK.\nRebos\nBusiness Analyst\nAğustos 2022 - Aralık 2022 (5 ay)\nLondon, England, United Kingdom\n- Optimised inventory levels using time series analysis, resulting in a 12%reduction in stockouts.- Led a data-driven revenue initiative that increased customer footfall by 5%,employing Python-based statistical analysis and regression modelling toidentify key purchasing behaviour drivers over one year.\nPage 1 of 3\ninzva\nProgram Analyst\nTemmuz 2020 - Temmuz 2022 (2 yıl 1 ay)\n- Managed 16 fully-funded projects, programmes, and educational eventsfocused on algorithms, engaging over 1,500 participants and streamlining thelearning experience.- Spearheaded the systematic collection and comprehensive analysis ofeducational programme data, utilising Python for data processing andapplying logistic regression to identify key factors influencing student retention,achieving a 25% increase in student retention and a 20% improvement ingraduation rates over two academic years.- Introduced innovative solutions, including hackathons and peer reviewsessions, aligned with best practices, increasing participant satisfaction by18% and enhancing skill development.\nCameroon Association of Active Youths (CAMAAY)\nProject Developer\nAğustos 2019 - Temmuz 2020 (1 yıl)\n- Developed the “Better Street Lighting for Better Livelihoods” project proposal,raising €2,000 to install 20 solar street lamps in Cameroon. This initiativetackled security issues stemming from inoperative lighting systems andcreated employment opportunities for seven local youths.\nTUBITAK\nResearch Assistant\nOcak 2020 - Mart 2020 (3 ay)\n- Conducted data preprocessing and analysis for the discussion paper“Regional Inequalities and the West-East Divide in Turkey” using Excel and Ron a large dataset spanning 1913–1991.\nBoğaziçi University\nUndergraduate Teaching Assistant\nEylül 2019 - Aralık 2019 (4 ay)\nEC101 Principles of Microeconomics\nEğitim\nThe London School of Economics and Political Science (LSE)\nMSc, Development Studies · (Eylül 2022 - Eylül 2023)\nPage 2 of 3\nBogazici University Department of Economics\nEconomics · (2015 - 2020)\nGhent University\nExchange, Economics · (2019 - 2019)\nPage 3 of 3",
      "parsed_at": "2025-06-16T20:33:58.511777",
      "file_path": "data\\cvs\\processed\\563b89be00c74ac0874c_20250616_203358_5307df1e_563b89be00c74ac0874cc9907e3fcf7d_Gül Çetin.txt"
    },
    {
      "candidate_id": "93e07ab45e8347b2a46d_20250616_203335_f6a43ad0",
      "file_name": "93e07ab45e8347b2a46d3f3f5214769c_Sahil Hussain.txt",
      "full_name": "Sahil Hussain",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "London, England, United Kingdom",
        "linkedin": "www.linkedin.com/in/sahil-hussain-992b1b261",
        "github": null
      },
      "summary": null,
      "skills": [
        "Snowflake",
        "Microsoft Azure",
        "Data Warehouse Architecture"
      ],
      "experience": [
        {
          "title": "Data Scientist",
          "company": "Ishka: Aviation Finance",
          "start_date": "02/2024",
          "end_date": "01/2025",
          "duration_months": 12,
          "description": null,
          "achievements": null
        },
        {
          "title": "Data Analyst",
          "company": "Vodafone",
          "start_date": "05/2023",
          "end_date": "02/2024",
          "duration_months": 10,
          "description": null,
          "achievements": null
        },
        {
          "title": "Data Analyst Apprentice",
          "company": "Vodafone",
          "start_date": "09/2020",
          "end_date": "05/2023",
          "duration_months": 33,
          "description": null,
          "achievements": null
        }
      ],
      "education": [
        {
          "degree": "Bachelor of Science - BSc",
          "institution": "Lancaster University",
          "graduation_year": 2023,
          "gpa": null,
          "field_of_study": "Data Science"
        },
        {
          "degree": "Bachelor of Science - BSc",
          "institution": "University of Greenwich",
          "graduation_year": 2020,
          "gpa": null,
          "field_of_study": "Psychology"
        }
      ],
      "certifications": [],
      "languages": [
        "English (Native or Bilingual)",
        "Bengali (Native or Bilingual)",
        "Spanish (Professional Working)",
        "Urdu (Limited Working)"
      ],
      "projects": [],
      "raw_text": "Contact\nwww.linkedin.com/in/sahil-hussain-992b1b261 (LinkedIn)\nTop Skills\nSnowflake\nMicrosoft Azure\nData Warehouse Architecture\nLanguages\nEnglish (Native or Bilingual)\nBengali (Native or Bilingual)\nSpanish (Professional Working)\nUrdu (Limited Working)\nSahil Hussain\nData Scientist\nLondon, England, United Kingdom\nExperience\nIshka: Aviation Finance\nData Scientist\nFebruary 2024 - January 2025 (1 year)\nCity Of London, England, United Kingdom\nVodafone\n3 years 6 months\nData Analyst\nMay 2023 - February 2024 (10 months)\nLondon, England, United Kingdom\nData Analyst Apprentice\nSeptember 2020 - May 2023 (2 years 9 months)\nEducation\nLancaster University\nBachelor of Science - BSc, Data Science · (September 2020 - May 2023)\nUniversity of Greenwich\nBachelor of Science - BSc, Psychology · (September 2017 - May 2020)\nPage 1 of 1",
      "parsed_at": "2025-06-16T20:33:35.194613",
      "file_path": "data\\cvs\\processed\\93e07ab45e8347b2a46d_20250616_203335_f6a43ad0_93e07ab45e8347b2a46d3f3f5214769c_Sahil Hussain.txt"
    },
    {
      "candidate_id": "c496109daf92456f96f5_20250616_203354_02ef2e8d",
      "file_name": "c496109daf92456f96f57a8286740067_Sharaf M.txt",
      "full_name": "Sharaf M.",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "London, England, United Kingdom",
        "linkedin": "www.linkedin.com/in/sharaf-momen-632886i",
        "github": null
      },
      "summary": null,
      "skills": [
        "GitHub",
        "ETL Tools",
        "Data Modeling",
        "AB testing",
        "Airflow",
        "Redshift",
        "QuickSight",
        "AWS Lambda",
        "PySpark",
        "PostgreSQL",
        "SQL",
        "Machine Learning",
        "CNN",
        "Topic Modelling",
        "Sentiment Analysis",
        "Web Scraping",
        "API Development",
        "Data Pipeline Development",
        "Dashboard Development",
        "Critical problem-solving",
        "Financial Planning",
        "Market planning",
        "Supply-chain management",
        "Public Relations",
        "Stakeholder management"
      ],
      "experience": [
        {
          "title": "Data Scientist",
          "company": "Muzz",
          "start_date": "05/2023",
          "end_date": "07/2024",
          "duration_months": 15,
          "description": "Work with AB testing/experiments for revenue and retention. Build and maintain dashboards to monitor revenue metrics and feature post-release analysis. Built an API that allows the data science team to personalise upsells to users. Update ELT pipelines regularly on Airflow. Segmentation tasks to personalise how we target and better help users. Work closely with data science team, and regularly conduct reviews of PRs and code for ETL pipelines, APIs, and SQL analysis.",
          "achievements": [
            "Built API for personalizing upsells to users",
            "Maintained dashboards for revenue metrics monitoring",
            "Conducted AB testing for revenue and retention optimization"
          ]
        },
        {
          "title": "Data Scientist",
          "company": "permutable.ai",
          "start_date": "08/2022",
          "end_date": "02/2023",
          "duration_months": 7,
          "description": "Built end-to-end data pipeline for the collection and sentiment analysis of tweets with Airflow and Redshift. Developed and managed QuickSight dashboards for clients to track the ESG profile of their supply chain. Worked on a project to source news in multiple languages asynchronously, as part of a larger Airflow DAG. Developed and deployed a web scraper through AWS Lambda to retrieve information to enhance brand SEO. Worked on data product demos with clients, engaged in product design, kept record of pain points from client feedback. Exposed to application of topic modelling to address relevant clusters that exist among all news articles collected.",
          "achievements": [
            "Built end-to-end data pipeline for tweet sentiment analysis",
            "Developed QuickSight dashboards for ESG tracking",
            "Deployed web scraper through AWS Lambda",
            "Implemented topic modelling for news article clustering"
          ]
        },
        {
          "title": "Data Scientist",
          "company": "Honest AI",
          "start_date": "04/2022",
          "end_date": "08/2022",
          "duration_months": 5,
          "description": "Integrated and tested third-party real estate APIs with existing data sources. Developed ETL pipeline using PySpark for PostgreSQL storage. Analysed and delivered insights from newly ingested real estate data in the UK. Incorporated explainability practices on Machine Learning algorithms for exploratory data analysis purposes. Developed a hybrid multi-input model that predicts house prices using a CNN embedding of neighbourhoods.",
          "achievements": [
            "Developed ETL pipeline using PySpark",
            "Created hybrid multi-input model for house price prediction",
            "Integrated third-party real estate APIs",
            "Implemented ML explainability practices"
          ]
        },
        {
          "title": "Junior Achievement Company Programme: CEO of Mindful Mugs",
          "company": "Junior Achievement Singapore",
          "start_date": "07/2016",
          "end_date": "01/2017",
          "duration_months": 7,
          "description": "As a CEO, ran a company under the annual Singapore Company Challenge, hosted by the Junior Achievement. Different Polytechnics, Junior Colleges and High Schools had to compete through having the best performing company, taking into consideration the processes undergone and the quality/accuracy of company literature.",
          "achievements": [
            "Won 2nd place in Singapore Company Challenge",
            "Led company as CEO in competitive business challenge"
          ]
        }
      ],
      "education": [
        {
          "degree": "Master of Science - MS",
          "institution": "UCL",
          "graduation_year": 2022,
          "gpa": null,
          "field_of_study": "Business Analytics"
        },
        {
          "degree": "Bachelor of Science - BS",
          "institution": "University of Warwick",
          "graduation_year": 2021,
          "gpa": null,
          "field_of_study": "International Management"
        },
        {
          "degree": "Year Abroad",
          "institution": "Schulich School of Business - York University",
          "graduation_year": 2019,
          "gpa": null,
          "field_of_study": "Business Administration and Management, General"
        },
        {
          "degree": "International Baccalaureate",
          "institution": "International School of Singapore",
          "graduation_year": 2017,
          "gpa": null,
          "field_of_study": null
        },
        {
          "degree": "Pre-diploma Level",
          "institution": "ABRSM",
          "graduation_year": 2016,
          "gpa": null,
          "field_of_study": "Music Theory and Piano Practical"
        }
      ],
      "certifications": [],
      "languages": [],
      "projects": [
        "API for personalizing upsells",
        "Tweet sentiment analysis pipeline",
        "ESG profile tracking dashboards",
        "Multi-language news sourcing system",
        "Web scraper for SEO enhancement",
        "Hybrid multi-input house price prediction model"
      ],
      "raw_text": "Contact\nwww.linkedin.com/in/sharaf-momen-632886i (LinkedIn)\nTop Skills\nGitHub\nETL Tools\nData Modeling\nSharaf M.\nData Scientist\nLondon, England, United Kingdom\nExperience\nMuzz\nData Scientist\nMay 2023 - July 2024 (1 year 3 months)\nCity Of London, England, United Kingdom\nI work with AB testing/experiments for revenue and retention. I build and maintain dashboards to monitor revenue metrics and feature post-release analysis.I built an API that allows the data science team to personalise upsells tousers. I also update ELT pipelines regularly on Airflow.There have been segmentation tasks that I helped with to personalise how wetarget and better help users. Work closely with data science team, and regularly conduct reviews of PRsand code for ETL pipelines, APIs, and SQL analysis.\npermutable.ai\nData Scientist\nAugust 2022 - February 2023 (7 months)\nLondon, England, United Kingdom\nBuilt end-to-end data pipeline for the collection and sentiment analysis oftweets with Airflow and Redshift.Developed and managed QuickSight dashboards for clients to track the ESGprofile of their supply chain. Worked on a project to source news in multiple languages asynchronously, aspart of a larger Airflow DAG. Developed and deployed a web scraper through AWS Lambda to retrieveinformation to enhance brand SEO. Worked on data product demos with clients, engaged in product design, keptrecord of pain points from client feedback.\nPage 1 of 3\nExposed to application of topic modelling to address relevant clusters that existamong all news articles collected.\nHonest AI\nData Scientist\nApril 2022 - August 2022 (5 months)\nLondon, England, United Kingdom\nIntegrated and tested third-party real estate APIs with existing data sources.Developed ETL pipeline using PySpark for PostgreSQL storage. Analysed and delivered insights from newly ingested real estate data in theUK. Incorporated explainability practices on Machine Learning algorithms forexploratory data analysis purposes.Developed a hybrid multi-input model that predicts house prices using a CNNembedding of neighbourhoods.\nJunior Achievement Singapore\nJunior Achievement Company Programme: CEO of Mindful Mugs\nJuly 2016 - January 2017 (7 months)\nSingapore\nAs a CEO, I ran a company under the annual Singapore Company Challenge,hosted by the Junior Achievement. Different Polytechnics, Junior Colleges andHigh Schools had to compete through having the best performing company,taking into consideration the processes undergone and the quality/accuracy ofcompany literature. Ultimately, my company won 2nd place in Singapore, equipping me with thefollowing corporate skills:- Critical problem-solving- Financial Planning and Literature- Market planning, research and strategy- Supply-chain management- Remuneration strategies and negotiation- Public Relations and stakeholder management\nEducation\nUCL\nMaster of Science - MS, Business Analytics · (September 2021 - June 2022)\nPage 2 of 3\nUniversity of Warwick\nBachelor of Science - BS, International Management · (2017 - 2021)\nSchulich School of Business - York University\nYear Abroad, Business Administration and Management,General · (2019 - 2019)\nInternational School of Singapore\nInternational Baccalaureate · (2015 - 2017)\nABRSM\nPre-diploma Level, Music Theory and Piano Practical · (September2012 - June 2016)\nPage 3 of 3",
      "parsed_at": "2025-06-16T20:33:54.833119",
      "file_path": "data\\cvs\\processed\\c496109daf92456f96f5_20250616_203354_02ef2e8d_c496109daf92456f96f57a8286740067_Sharaf M.txt"
    },
    {
      "candidate_id": "018cea4e5b6f49c494fb_20250616_203339_6bf9f686",
      "file_name": "018cea4e5b6f49c494fb9fd9401237dc_Siddhesh Sathe.txt",
      "full_name": "Siddhesh Sathe",
      "contact_info": {
        "email": null,
        "phone": null,
        "location": "London Area, United Kingdom",
        "linkedin": "www.linkedin.com/in/thesidsat",
        "github": null
      },
      "summary": "I have effectively assisted clients worldwide in meeting their business and technical objectives through implementation of data science solutions. My expertise is in leveraging artificial intelligence, and I hold a Master's degree in Computer Science with specialization in AI from University of Leeds. Currently, I am applying my skills and knowledge as a member of the TradeTeq team, actively contributing to the company's success.",
      "skills": [
        "Langchain",
        "Programming",
        "Data Mining",
        "Artificial Intelligence",
        "Data Science",
        "Machine Learning",
        "Computer Vision",
        "NLP",
        "Docker",
        "RESTful APIs",
        "ANNs",
        "LSTMs",
        "YOLO",
        "Predictive Modelling",
        "Risk Management",
        "FX Trading",
        "Oracle Development"
      ],
      "experience": [
        {
          "title": "Data Scientist",
          "company": "Tradeteq",
          "start_date": "05/2022",
          "end_date": "03/2025",
          "duration_months": 35,
          "description": null,
          "achievements": []
        },
        {
          "title": "Artificial Intelligence Engineer",
          "company": "Redev Ltd",
          "start_date": "11/2020",
          "end_date": "05/2022",
          "duration_months": 19,
          "description": "AI/Data Science",
          "achievements": [
            "Actively managed core trading strategies across FX and indices",
            "Designed, developed and backtested Risk Management and profit taking capabilities resulting in higher Alpha",
            "Established dockerised AI modules with RESTful APIs to streamline transition from prototyping to deployment",
            "Designed ANNs and LSTMs in predictive modelling",
            "Extended YOLO to detect fraud from CCTV feed in a resource constrained environment"
          ]
        },
        {
          "title": "Analytics Consultant",
          "company": "Redev Ltd",
          "start_date": "01/2020",
          "end_date": "10/2020",
          "duration_months": 10,
          "description": null,
          "achievements": []
        },
        {
          "title": "Freelance Data Scientist",
          "company": "Upwork",
          "start_date": "06/2017",
          "end_date": "09/2019",
          "duration_months": 28,
          "description": "Former Top Rated freelancer - Top 10% of freelancers on the platform.I worked on delivering end to end data science solutions to 20+ clients acrossindustries in computer vision, NLP and machine learning.",
          "achievements": [
            "Top Rated freelancer - Top 10% of freelancers on the platform",
            "Delivered end to end data science solutions to 20+ clients across industries"
          ]
        },
        {
          "title": "Winter Intern",
          "company": "Aalborg Universitet",
          "start_date": "12/2016",
          "end_date": "12/2016",
          "duration_months": 1,
          "description": null,
          "achievements": []
        },
        {
          "title": "Intern(Oracle Dev)",
          "company": "Forbes Marshall",
          "start_date": "06/2016",
          "end_date": "06/2016",
          "duration_months": 1,
          "description": null,
          "achievements": []
        }
      ],
      "education": [
        {
          "degree": "MSc. Advanced Computer Science",
          "institution": "University of Leeds",
          "graduation_year": 2020,
          "gpa": null,
          "field_of_study": "Artificial Intelligence"
        },
        {
          "degree": "Bachelor of Engineering (B.E.)",
          "institution": "University of Pune",
          "graduation_year": 2017,
          "gpa": null,
          "field_of_study": "Computer Science"
        }
      ],
      "certifications": [
        "AMCAT Certified Data Processing Specialist",
        "Statistical Learning",
        "AMCAT Certified Business Analyst"
      ],
      "languages": [],
      "projects": [],
      "raw_text": "Contact\nwww.linkedin.com/in/thesidsat\n(LinkedIn)\nTop Skills\nLangchain\nProgramming\nData Mining\nCertifications\nAMCAT Certified Data Processing\nSpecialist\nStatistical Learning\nAMCAT Certified Business Analyst\nSiddhesh Sathe\nData Scientist\nLondon Area, United Kingdom\nSummary\nI have effectively assisted clients worldwide in meeting their business\nand technical objectives through implementation of data science\nsolutions. My expertise is in leveraging artificial intelligence, and I\nhold a Master's degree in Computer Science with specialization in AI\nfrom University of Leeds.\nCurrently, I am applying my skills and knowledge as a member of the\nTradeTeq team, actively contributing to the company's success.\nThe observations and thoughts shared here are strictly my own and\ndo not reflect the views of any other individual or organization.\nExperience\nTradeteq\nData Scientist\nMay 2022 - March 2025 (2 years 11 months)\nLondon, England, United Kingdom\nRedev Ltd\n2 years 5 months\nArtificial Intelligence Engineer\nNovember 2020 - May 2022 (1 year 7 months)\nLeeds, England, United Kingdom\nActively managed core trading strategies across FX and indices.\nDesigned, developed and backtested Risk Management and profit taking\ncapabilities resulting in higher Alpha.\nAI/Data Science\nEstablished dockerised AI modules with RESTful APIs to streamline transition\nfrom prototyping to deployment.\nDesigned ANNs and LSTMs in predictive modelling.\nExtended YOLO to detect fraud from CCTV feed in a resource constrained\nenvironment.\nAnalytics Consultant\nPage 1 of 2\nJanuary 2020 - October 2020 (10 months)\nLeeds, United Kingdom\nUpwork\nFreelance Data Scientist\nJune 2017 - September 2019 (2 years 4 months)\nFormer Top Rated freelancer - Top 10% of freelancers on the platform.I worked on delivering end to end data science solutions to 20+ clients acrossindustries in computer vision, NLP and machine learning.\nAalborg Universitet\nWinter Intern\nDecember 2016 - December 2016 (1 month)\nCopenhagen Area, Denmark\nForbes Marshall\nIntern(Oracle Dev)\nJune 2016 - June 2016 (1 month)\nEducation\nUniversity of Leeds\nMSc. Advanced Computer Science , Artificial Intelligence · (2019 - 2020)\nUniversity of Pune\nBachelor of Engineering (B.E.), Computer Science · (2013 - 2017)\nPage 2 of 2",
      "parsed_at": "2025-06-16T20:33:39.867511",
      "file_path": "data\\cvs\\processed\\018cea4e5b6f49c494fb_20250616_203339_6bf9f686_018cea4e5b6f49c494fb9fd9401237dc_Siddhesh Sathe.txt"
    },
    {
      "candidate_id": "4ec2b3c8a2544371b091_20250616_203404_859c21bb",
      "file_name": "4ec2b3c8a2544371b091f215cd1ac42d_Saad LAOUADI.txt",
      "full_name": "Saad Laouadi",
      "contact_info": {
        "email": "dr.saad.laouadi@gmail.com",
        "phone": "+213 670 72 95 61",
        "location": "Boumerdes, Algeria",
        "linkedin": "linkedin.com/in/saad-laouadi",
        "github": "github.com/dr-saad-la"
      },
      "summary": "Data Scientist with seven (7) years of experience and advanced expertise in machine learning, deep learning, and artificial intelligence. Versatile professional with demonstrated success applying data science solutions across diverse sectors including education, health care, cybersecurity, and agriculture. Combines technical proficiency in programming with strong analytical thinking and leadership capabilities. Experienced AI instructor with the ability to communicate complex concepts effectively. Committed to leveraging data-driven insights to solve challenging business problems and drive innovation.",
      "skills": [
        "Python",
        "R",
        "Julia",
        "Rust",
        "SQL",
        "JavaScript",
        "C++",
        "TensorFlow",
        "PyTorch",
        "Keras",
        "scikit-learn",
        "XGBoost",
        "LightGBM",
        "Hugging Face Transformers",
        "Pandas",
        "Polars",
        "NumPy",
        "SciPy",
        "statsmodels",
        "Matplotlib",
        "Seaborn",
        "Plotly",
        "ggplot2",
        "GDAL",
        "QGIS",
        "GeoPandas",
        "PostGIS",
        "OpenCV",
        "YOLO",
        "EfficientNet",
        "UNet",
        "SegNet",
        "Detectron2",
        "Docker",
        "Kubernetes",
        "MLflow",
        "Machine Learning",
        "Deep Learning",
        "Computer Vision Systems",
        "Natural Language Processing",
        "Statistical Analysis & Modeling",
        "AI Model Development & Optimization",
        "Technical Training & Knowledge Transfer",
        "Research & Development",
        "Cross-functional Team Leadership",
        "Domain Adaptation",
        "Data Pipeline Architecture"
      ],
      "experience": [
        {
          "title": "AI Instructor",
          "company": "FREELANCE",
          "start_date": "11/2024",
          "end_date": "Present",
          "duration_months": null,
          "description": "Remote position teaching AI and deep learning courses",
          "achievements": [
            "Developed and delivered comprehensive curriculum on the foundations of deep learning, providing students with both theoretical knowledge and practical implementation skills",
            "Designed specialized course on applying deep learning techniques to sequential data analysis, covering RNNs, LSTMs, and transformers with real-world applications",
            "Created and taught advanced computer vision course, focusing on convolutional neural networks, object detection, and image segmentation techniques",
            "Mentored students through complex AI projects, providing code reviews and implementation guidance",
            "Maintained high student satisfaction ratings through engaging teaching methods and accessible explanations of complex technical concepts"
          ]
        },
        {
          "title": "Data Science Consultant",
          "company": "GROWTECH",
          "start_date": "06/2022",
          "end_date": "10/2024",
          "duration_months": 28,
          "description": "Remote consulting position focused on agricultural AI solutions",
          "achievements": [
            "Led a specialized team focused on developing AI models for early detection of Red Palm Weevil infestations, a critical agricultural pest",
            "Designed and built computer vision models that achieved 94% accuracy in identifying plant diseases from image data",
            "Created custom deep learning algorithms to detect subtle signs of pest damage before visible symptoms appeared",
            "Collaborated with agronomists to refine model parameters based on field expertise and regional agricultural patterns",
            "Established standardized methodologies for data collection and preparation, improving model training efficiency by 40%"
          ]
        },
        {
          "title": "Statistician / Data Scientist",
          "company": "QATAR ORGANIZATION",
          "start_date": "2018",
          "end_date": "2023",
          "duration_months": 60,
          "description": "Data science and statistical analysis role in Doha, Qatar",
          "achievements": [
            "Architected and implemented a comprehensive data entry system that streamlined information collection and improved data integrity",
            "Developed advanced natural language processing solutions for automated document analysis and information extraction",
            "Created and deployed document classification algorithms",
            "Conducted statistical analysis on large datasets to identify patterns and generate actionable insights for organizational decision-making",
            "Delivered training programs on statistical methods and data analysis techniques to colleagues"
          ]
        }
      ],
      "education": [
        {
          "degree": "Ph.D. in Applied Economics",
          "institution": "BLIDA UNIVERSITY",
          "graduation_year": 2017,
          "gpa": null,
          "field_of_study": "Applied Economics"
        },
        {
          "degree": "Master's Degree in Econometrics",
          "institution": "BLIDA UNIVERSITY",
          "graduation_year": 2012,
          "gpa": null,
          "field_of_study": "Econometrics"
        },
        {
          "degree": "Bachelor's Degree in Economics",
          "institution": "BLIDA UNIVERSITY",
          "graduation_year": 2010,
          "gpa": null,
          "field_of_study": "Economics"
        }
      ],
      "certifications": [
        "Professional Certificate in Data Science, edX (2019)",
        "Machine Learning with R, DataCamp (2020)",
        "Data Scientist with Python, DataCamp (2021)",
        "Data Scientist with R, DataCamp (2021)",
        "Python Programmer, DataCamp (2022)",
        "R Programmer, DataCamp (2022)",
        "SAS Programmer, SAS Corporation (2019)",
        "SAS Data Scientist, SAS Corporation (2019)"
      ],
      "languages": [],
      "projects": [
        "Soil Nutrient Optimization System — Developed machine learning models to predict optimal nutrient composition based on crop type, soil condition, and climate data",
        "Water Quality Monitoring Network — Created real-time anomaly detection system for irrigation water quality using sensor data and time series analysis, identifying contaminants with 94% accuracy",
        "Crop Disease Prediction Model — Designed deep learning system to identify early signs of plant diseases from multispectral imagery",
        "Microclimate Mapping for Precision Agriculture — Built spatial analysis model combining satellite imagery, ground sensors, and topographical data to enable field-specific planting recommendations",
        "Sustainable Irrigation AI System — Developed reinforcement learning algorithm to optimize irrigation scheduling based on weather forecasts, soil moisture, and plant growth stages"
      ],
      "raw_text": "SAAD LAOUADI, PH.D.\nDATA SCIENTIST\n#dr.saad.laouadi@gmail.com +213 670 72 95 61\nïlinkedin.com/in/saad-laouadi §github.com/dr-saad-la\n+ Boumerdes, Algeria\nProfessional Profile\nData Scientist with seven (7) years of experience and advanced expertise in machine learning, deep learning, and artificial\nintelligence. Versatile professional with demonstrated success applying data science solutions across diverse sectors including\neducation, health care, cybersecurity, and agriculture. Combines technical proficiency in programming with strong analytical\nthinking and leadership capabilities. Experienced AI instructor with the ability to communicate complex concepts effectively.\nCommitted to leveraging data-driven insights to solve challenging business problems and drive innovation.\nProfessional Experience\nFREELANCE November 2024 – Present\nAI Instructor Remote\n• Developed and delivered comprehensive curriculum on the foundations of deep learning, providing students with both\ntheoretical knowledge and practical implementation skills\n• Designed specialized course on applying deep learning techniques to sequential data analysis, covering RNNs, LSTMs, and\ntransformers with real-world applications\n• Created and taught advanced computer vision course, focusing on convolutional neural networks, object detection, and\nimage segmentation techniques\n• Mentored students through complex AI projects, providing code reviews and implementation guidance\n• Maintained high student satisfaction ratings through engaging teaching methods and accessible explanations of complex\ntechnical concepts\nGROWTECH June 2022 – October 2024\nData Science Consultant Remote\n• Led a specialized team focused on developing AI models for early detection of Red Palm Weevil infestations, a critical\nagricultural pest\n• Designed and built computer vision models that achieved 94% accuracy in identifying plant diseases from image data\n• Created custom deep learning algorithms to detect subtle signs of pest damage before visible symptoms appeared\n• Collaborated with agronomists to refine model parameters based on field expertise and regional agricultural patterns\n• Established standardized methodologies for data collection and preparation, improving model training efficiency by 40\n1\nQATAR ORGANIZATION 2018 – 2023\nStatistician / Data Scientist Doha, Qatar\n• Architected and implemented a comprehensive data entry system that streamlined information collection and improved\ndata integrity\n• Developed advanced natural language processing solutions for automated document analysis and information extraction\n• Created and deployed document classification algorithms.\n• Conducted statistical analysis on large datasets to identify patterns and generate actionable insights for organizational\ndecision-making\n• Delivered training programs on statistical methods and data analysis techniques to colleagues.\nTechnical Skills\n• Programming Languages: Python, R, Julia, Rust,\nSQL, JavaScript, C++\n• Machine Learning: TensorFlow, PyTorch, Keras, scikitlearn,\nXGBoost, LightGBM, Hugging FaceTransformers\n• Data Analysis: Pandas, Polars, NumPy, SciPy, statsmodels,\nMatplotlib, Seaborn, Plotly, ggplot2\n• Agriculture Technologies: GDAL, QGIS, GeoPandas,\nPostGIS.\n• Computer Vision: OpenCV, YOLO, EfficientNet, UNet,\nSegNet, Detectron2\n• Cloud & Infrastructure: Docker, Kubernetes,\nMLflow.\nSelected Projects\n• Soil Nutrient Optimization System — Developed machine learning models to predict optimal nutrient composition\nbased on crop type, soil condition, and climate data.\n• Water Quality Monitoring Network—Created real-time anomaly detection system for irrigation water quality using\nsensor data and time series analysis, identifying contaminants with 94% accuracy.\n• Crop Disease Prediction Model — Designed deep learning system to identify early signs of plant diseases from multispectral\nimagery.\n• Microclimate Mapping for Precision Agriculture—Built spatial analysis model combining satellite imagery, ground\nsensors, and topographical data to enable field-specific planting recommendations.\n• Sustainable Irrigation AI System — Developed reinforcement learning algorithm to optimize irrigation scheduling\nbased on weather forecasts, soil moisture, and plant growth stages.\nEducation\nBLIDA UNIVERSITY 2013 – 2017\nPh.D. in Applied Economics Blida, Algeria\n• Dissertation focused on statistical and econometric modeling applications in economic analysis\n• Applied advanced quantitative methods to solve complex economic problems\nBLIDA UNIVERSITY 2010 – 2012\nMaster’s Degree in Econometrics Blida, Algeria\n2\nBLIDA UNIVERSITY 2007 – 2010\nBachelor’s Degree in Economics Blida, Algeria\nAreas of Expertise\n• Machine Learning & Deep Learning\n• Computer Vision Systems\n• Natural Language Processing\n• Statistical Analysis &Modeling\n• AIModel Development & Optimization\n• Technical Training & Knowledge Transfer\n• Research & Development\n• Cross-functional Team Leadership\n• Domain Adaptation (Agriculture, Education, Health\ncare, Cyber security)\n• Data Pipeline Architecture\nCertifications & Professional Development\nCertifications: Professional Development:\n• Professional Certificate in Data Science, edX (2019)\n• Machine Learning with R, DataCamp (2020)\n• Data Scientist with Python, DataCamp (2021)\n• Data Scientist with R, DataCamp (2021)\n• Python Programmer, DataCamp (2022)\n• R Programmer, DataCamp (2022)\n• SAS Programmer, SAS Corporation (2019)\n• SAS Data Scientist, SAS Corporation (2019)\n• Advanced Computer Vision Techniques, Stanford Online\n(2023)\n• Natural Language ProcessingWorkshop, AI Conference\n(2022)\n• Deep Learning for Time Series Analysis, Workshop\n(2020)\n3",
      "parsed_at": "2025-06-16T20:34:04.537684",
      "file_path": "data\\cvs\\processed\\4ec2b3c8a2544371b091_20250616_203404_859c21bb_4ec2b3c8a2544371b091f215cd1ac42d_Saad LAOUADI.txt"
    }
  ],
  "screening_results": null,
  "detailed_evaluations": [],
  "interview_questions": [],
  "comparison_analysis": null,
  "session_status": "screening",
  "created_at": "2025-06-16T20:33:21.734295",
  "updated_at": "2025-06-16T20:34:15.026639",
  "metadata": {},
  "configuration": {
    "qualificationThreshold": 70,
    "evaluationMode": "comprehensive",
    "topNCandidates": 5,
    "analysisType": "full",
    "scoringWeights": {
      "technical": 30,
      "experience": 25,
      "culture": 20,
      "soft": 15,
      "education": 10
    },
    "options": {
      "autoGenerateInterviews": true,
      "compareCandidates": true,
      "detailedReports": true,
      "enableBiasDetection": true,
      "predictiveAnalysis": true,
      "marketIntelligence": true
    }
  }
}